local M = {}

M.ruleTxt = "【游戏简介】\n斗地主是一种扑克游戏。游戏最少由3个玩家进行，用一副54张牌（连鬼牌），其中一方为地主，其余两家为另一方，双方对战，先出完牌的一方获胜。该扑克游戏最初流行于中国湖北武汉市汉阳区，现已逐渐在各地流行。\n【牌型规则】\n牌点从大到小排序：大王、 小王、 2、 A、 K、 Q、 J、 10、 9、 8、 7、 6、 5、 4、 3\n花色大小：不分花色大小。\n火箭：即双王（大王和小王），最大的牌。\n炸弹：四张同数值牌（如四个 6 ）。\n	单牌：单个牌（如红桃 5 ）。\n	对牌：数值相同的两张牌（如梅花 3+ 方块 3 ）。\n	三张牌：数值相同的三张牌（如三个 J ）。\n	三带一：数值相同的三张牌 + 一张单牌例如： 333+6 \n	三带对：数值相同的三张牌+对拍 例如  444+99\n	顺子：五张或更多的连续单牌（如： 45678 或 78910JQK ）。不包括 2 点和双王。\n	连对：三对或更多的连续对牌（如： 334455 、7788991010JJ ）。不包括 2 点和双王。\n	飞机：三顺＋同数量的单牌（或同数量的对牌）。\n	如：333444 或者 444555+79 或 333444555+7799JJ	\n四带二：四张牌＋两手牌。（注意：四带二不是炸弹）。\n	如： 5555 ＋ 3 ＋ 8 或 4444 ＋ 55 ＋ 77 。\n	【牌型大小】\n	火箭最大，可以打任意其他的牌。\n	炸弹比火箭小，比其他牌大。都是炸弹时按牌的分值比大小。\n	除火箭和炸弹外，其他牌必须要牌型相同且总张数相同才能比大小。\n	单牌按分值比大小，依次是 大王 > 小王 >2>A>K>Q>J>10>9>8>7>6>5>4>3，不分花色。\n	对牌、三张牌都按分值比大小。\n	顺牌按最大的一张牌的分值来比大小。\n	飞机带翅膀和四带二按其中的三顺和四张部分来比，带的牌不影响大小。\n	【胜负规则】\n	任意一家出完牌后结束游戏，若是地主先出完牌则地主胜，否则另外两家胜。\n"
M.Game_no_gold     = "金币不足"
M.Limit1            = "%s-%s"
M.Limit2            = "%s以上"
M.noPlayerCallDD = "本轮无人叫地主，系统随机选择一名玩家当地主"
M.Kan_jin_fail     = "进入房间失败,请重试!"
M.gameResultBet = {
	[0]="总倍数X%d倍",
	"初始X%d倍",
	"叫抢X%d倍",
	"底牌X%d倍",
	"炸弹X%d倍",
	"明牌X%d倍",
	"春天X%d倍",
	"加倍X%d倍",
}
M.gameResultLevel = {
	[1]="青铜一阶",
	"青铜二阶",
	"青铜三阶",
	"白银一阶",
	"白银二阶",
	"白银三阶",
	"黄金一阶",
	"黄金二阶",
	"黄金三阶",
	"钻石一阶",
	"钻石二阶",
	"钻石三阶",
	"传奇宗师",
	"最强王者",
}

M.gameBeiInfo = {
	[1] = "初始",
	[2] = "明牌",
	[3] = "春天",
	[4] = "底牌",
	[5] = "炸弹",
	[6] = "抢地主",
	[7] = "公共倍数",
	[8] = "地主加倍",
	[9] = "农民加倍",
	[10] = "总倍数"
}

M.matchGameBeiInfo = {
	[1] = "初始",
	[2] = "春天",
	[3] = "底牌",
	[4] = "炸弹",
	[5] = "叫分",
	[6] = "公共倍数",
	[7] = "地主加倍",
	[8] = "农民加倍",
	[9] = "总倍数",
}

M.game_name = {
	[1] = "新手场",
	[2] = "初级场",
	[3] = "普通场",
	[4] = "中级场",
	[5] = "高级场",
	[6] = "顶级场"
}

M.callTypeName = {
	[1] = "不叫",
	[2] = "叫地主",
	[3] = "不抢",
	[4] = "抢地主",
}

M.callDoubleName = {
	[0] = "不加倍",
	[1] = "加倍",
	[2] = "超级加倍"
}

M.HoleCardsType = {
    [1] = "大王翻%d倍",
    [2] = "小王翻%d倍",
    [3] = "同花翻%d倍",
    [4] = "顺子翻%d倍",
    [5] = "双王翻%d倍",
    [6] = "同花顺翻%d倍",
    [7] = "三张翻%d倍"
}
M.hand_card_type_bei_img = "img_bei_%d.png"

M.classic_desk_name = "经典玩法  %s  底分 %s"
M.classic_desk_desc = "服务费%s  封顶%s"
M.unshuffle_desk_name = "不洗牌  %s  底分 %s"

M.classic_start_txt = "明牌开始x%d"
M.classic_showcard_txt = "明牌x%d"

M.card_remember_perGame = "记牌器（1局）"
M.card_remember_daily = "记牌器（1天）"
M.buy_success = "购买成功"
M.user_next = "下一局才可以使用哦~"
M.buy_fail = "购买失败~"
M.should_to_advanced_room = "您的金币太多了，去%s试试吧。"
M.should_to_low_level_room = "您的金币太少了，去%s试试吧。"
M.no_call_double_card = "当前无超级加倍卡！"

M.ddz_quit_room_tips = "退出后将由笨笨的机器人代打哦，确定退出吗？"
M.ddz_hall_return_game_tips = "亲，您正在其他场次游戏，是否回去？"

M.cannot_double_tips = "金币大于1000才可以加倍哦"
M.match_timeout = "匹配失败，待会再来哦"

M.cannot_double_tips_1 = "您对手的金币不足%d，无法加倍"
M.cannot_double_tips_2 = "您的金币不足%d，无法加倍"

M.match_result_txt = {
    "基础奖励:+",
    "等级加成:+",
    "地主加成:+",
    "总奖券:+"
}

M.match_result_savestar_txt = "%s次"
M.boxViewTitle = "晋级%s奖励"

DDZ_TXT = M